//
// Created by 郑楚彬 on 2020/9/10.
//

#ifndef TIANQINDATASTRUCT_EXERCISES_HPP
#define TIANQINDATASTRUCT_EXERCISES_HPP

/*
 * 8.3 交换排序 p323-p324
 */
/**
 * 2. 编写双向冒泡排序算法，在正反两个方向交替进行扫描，即第一趟把关键字最大的元素放在序列的最后面，
 *    第二趟把关键字最小的元素放在序列的最前面，如此反复进行。
 */

/**
 * 3. 已知线性表按顺序存储，且每个元素都是不相同的整数型元素，设计把所有奇数移动到所有偶数前边的算法(要求时间最少，辅助空间最少)。
 */

/**
 * 4. 试重新编写考点精析中的快速排序的划分算法，使之每次选取的枢轴值都是随机地从当前子表中选择的。
 */

/**
 * 5. 试编写一个算法，使之能够在数组 L[1...n] 中找出第 k 小的元素(即从小到大排序后处于第 k 个位置的元素)。
 */

/**
 * 6.【2016 统考真题】己知由 n(n>=2) 个正整数构成的集合 A= {a_k|O<=k<n} 时，将其划分为两个不相交的子集 A_1 和 A_2，
 *    元素个数分别是 n_1 和 n_2，A_1 和 A_2 中的元素之和分别为 S_1 和 S_2。设计一个尽可能高效的划分算法，
 *    满足 |n_1-n_2| 最小且 |S_1-S_2| 最大。
 */
/**
 * 7. 荷兰国旗问题:设有一个仅由红、白、蓝三种颜色的条块组成的条块序列，请编写一个时间复杂度为 O(n)的算法，使得这些条块
 *    按红、白、蓝的顺序排好，即排成荷兰国旗图案。
 */

/*
 * 8.4 选择排序 p335
 */
/**
 * 4. 编写一个算法，在基于单链表表示的待排序关键字序列上进行简单选择排序。
 */
/**
 * 5. 试设计一个算法，判断一个数据序列是否构成一个小根堆。
 */

/*
 * 8.6 各种内部排序算法的比较和应用
 */
/**
 * 2. 设顺序表用数组 A[] 表示，表中元素存储在数组下标 1~ m+n 的范围内，前 m 个元素递增有序，后 n 个元素递增有序，设计一个算法，
 *    使得整个顺序表有序。
 */

/**
 * 4. 设有一个数组中存放了一个无序的关键序列 K_1,K_2，...，K_n。 现要求将 K_n，放在将元素排序后的正确位置上，
 *    试编写实现该功能的算法，要求比较关键字的次数不超过 n。
 */

#endif //TIANQINDATASTRUCT_EXERCISES_HPP
