//
// Created by 郑楚彬 on 2018/5/23.
//
#include "../utility/Sort/Sorting.h"

/**
 * 插入类排序
 */
void test(){
    //int R[8] = {49, 38, 65, 97, 76, 13, 27, 49};
    //printIntArray("  原始数组   ", R, 8);
    //
    ////=============================//
    //// 插入类排序
    ////=============================//
    cout<< "1. 直接插入排序" << endl;
    int R[8] = {49, 38, 65, 97, 76, 13, 27, 49};
    insertSort(R, 8);
    cout<< endl;

    //cout<< "2. 折半插入排序" << endl;
    //int R1[8] = {49, 38, 65, 97, 76, 13, 27, 49};
    //binaryInsertSort(R1, 8);
    //cout<< endl;
    //
    //cout<< "3. 希尔排序" << endl;
    //int R2[15] = {99, 5, 69, 33, 56, 13, 22, 55, 77, 48, 12, 88, 2,69,99};
    //printIntArray("  原始数组   ", R2, 15);
    //shellSort(R2, 15);
    //cout<< endl;
    //
    ////=============================//
    //// 交换类排序
    ////=============================//
    //cout<< "4. 冒泡排序" << endl;
    //int R3[8] = {49, 38, 65, 97, 76, 13, 27, 49};
    //bubbleSort(R3, 8);
    //cout<< endl;
    //
    cout<< "5. 快速排序" << endl;
    int R4[8] = {49, 38, 65, 97, 76, 13, 27, 49};
    quickSort(R4, 0, 7);
    cout<< endl;

    ////=============================//
    //// 选择类排序
    ////=============================//
    //cout<< "6. 简单选择排序" << endl;
    //int R5[8] = {49, 38, 65, 97, 76, 13, 27, 49};
    //selectSort(R5, 8);
    //cout<< endl;

    cout<< "7. 堆排序" << endl;
    //int R6[9] = {20,50,20,40,70,10,80,30,60};
    int R6[8] = {53,17,78,9,45,65,87,32};
    heapSort(R6, 8);
    cout<< endl;

    //=============================//
    // 归并排序(二路)
    //=============================//
    //cout<< "8. 二路归并排序" << endl;
    //int R7[5] = {11,2,8,7,4};
    //mergeSort(R7, 0, 4);
}

int main(){
    test();
}